package ru.rkapp.methods;

import ru.rkapp.ButcherTableMethod;
import ru.rkapp.RightCalculator;

/*
 * Метод Рунге-Кутты 6-го порядка (Butcher's RK6(7)).
 * 
 * Вариант "a" из работ Дж. К. Бутчера (J.C. Butcher). 
 * Характеристики:
 *   - Порядок: 6 (основная формула)
 * 
 * Коэффициенты:
 *   c = [0.5, 2/3, 1/3, 5/6, 1/6, 1.0]
 *   b = [13/200, 0, 11/40, 11/40, 4/25, 4/25, 13/200]
 *   a = [
 *        0.5, 
 *        2/9, 4/9, 
 *        7/36, 2/9, -1/12,
 *        -35/144, -55/36, 35/48, 15/8,
 *        -1/360, -11/36, -1/8, 0.5, 0.1,
 *        -41/260, 22/13, 43/156, -118/39, 32/195, 80/39
 *      ]
 */
public class CRK6a extends ButcherTableMethod {
    private static final double[] C = {
        0.5,    // c2
        2.0/3,  // c3 
        1.0/3,  // c4 
        5.0/6,  // c5 
        1.0/6,  // c6 
        1.0     // c7
    };
    private static final double[] B = {
        13.0/200,   // b1
        0.0,        // b2
        11.0/40,    // b3
        11.0/40,    // b4
        4.0/25,     // b5
        4.0/25,     // b6
        13.0/200    // b7
    };
    private static final double[] A = {
        // Первая строка матрицы A (индекс 0)
        0.5,    // a21
        
        // Вторая строка (индексы 1-2)
        2.0/9,  // a31
        4.0/9,  // a32
        
        // Третья строка (индексы 3-5)
        7.0/36, // a41
        2.0/9,  // a42
        -1.0/12,// a43
        
        // Четвертая строка (индексы 6-9)
        -35.0/144,  // a51
        -55.0/36,   // a52
        35.0/48,    // a53
        15.0/8,     // a54
        
        // Пятая строка (индексы 10-14)
        -1.0/360,   // a61
        -11.0/36,   // a62
        -1.0/8,     // a63
        0.5,        // a64
        0.1,        // a65
        
        // Шестая строка (индексы 15-20)
        -41.0/260,  // a71
        22.0/13,    // a72
        43.0/156,   // a73
        -118.0/39,  // a74
        32.0/195,   // a75
        80.0/39     // a76
    };
    
    /**
     * Конструктор метода.
     *
     * @param calculator Вычислитель правых частей системы ОДУ.
     */
    public CRK6a(RightCalculator calculator) {
        super(calculator, C, B, A);
    }
}